**`teams/nomis/rhel_7_9_oracledb_11_2`** terragrunt plan on `push` event [#898](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-oracledb-11-2"
        name         = "nomis_rhel_7_9_oracledb_11_2"
      ~ tags         = {
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
            # (10 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "nomis rhel 7.9 oracleDB 11.2 image"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-oracledb-11-2"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "nomis_rhel_7_9_oracledb_11_2"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                  = "NOMIS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          + "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          + "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          + "update-linux-version"         = "1.0.2"
        }
      + tags_all                         = {
          + "application"                  = "NOMIS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "nomis_rhel_7_9_oracledb_11_2"
          + "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          + "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          + "update-linux-version"         = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.4.4" -> (known after apply)
      ~ date_created      = "2023-03-23T11:49:34.969Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.4.4" -> (known after apply)
        name              = "nomis_rhel_7_9_oracledb_11_2"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "branch"                       = "nomis/DSOS-1817/updated-oracle-11-image" -> "main"
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "branch"                       = "nomis/DSOS-1817/updated-oracle-11-image" -> "main"
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ user_data_base64  = "" -> (known after apply)
      ~ version           = "0.4.4" -> "0.4.5" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdg" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdg"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdh" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdh"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdi" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdi"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdk" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdk"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sds" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 4 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sds"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 4
              + volume_type           = "gp3"
            }
        }

      ~ component {
            # (1 unchanged attribute hidden)

          + parameter { # forces replacement
              + name  = "Branch"
              + value = "main"
            }
          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "nomis/DSOS-1817/oracle-11g-ami-update" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-4-4" -> (known after apply)
      ~ date_created                  = "2023-03-23T11:49:34.409Z" -> (known after apply)
      ~ date_updated                  = "2023-03-24T13:30:43.883Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-4-4" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_oracledb_11_2_0_4_4" -> "nomis_rhel_7_9_oracledb_11_2_0_4_5" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
            # (10 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
          ~ "infrastructure-configuration" = "nomis_rhel_7_9_oracledb_11_2/0.4.4" -> "nomis_rhel_7_9_oracledb_11_2/0.4.5"
            # (10 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```
